In [72]:
from bs4 import BeautifulSoup
import requests
import pandas as pd
import numpy as np
import sqlite3
from datetime import datetime

In [73]:
url = 'https://web.archive.org/web/20230902185326/https://en.wikipedia.org/wiki/List_of_countries_by_GDP_%28nominal%29'
table_attribs = ["Country", "GDP_USD_millions"]
db_name = 'World_Economies.db'  
table_name = 'Countries_by_GDP'
csv_path = './Countries_by_GDP.csv'

In [74]:
def extract(url, table_attribs):
    ''' The purpose of this function is to extract the required
    information from the website and save it to a dataframe. The
    function returns the dataframe for further processing. '''
    page = requests.get(url).text
    data = BeautifulSoup(page,'html.parser')
    df = pd.DataFrame(columns=table_attribs)
    tables = data.find_all('tbody')
    rows = tables[2].find_all('tr')
    for row in rows:
        col = row.find_all('td')
        if len(col)!=0:
            if col[0].find('a') is not None and '—' not in col[2]:
                data_dict = {"Country": col[0].a.contents[0],
                             "GDP_USD_millions": col[2].contents[0]}
                df1 = pd.DataFrame(data_dict, index=[0])
                df = pd.concat([df,df1], ignore_index=True)
    return df

In [77]:
extract(url, table_attribs).

              Country GDP_USD_millions
0       United States       26,854,599
1               China       19,373,586
2               Japan        4,409,738
3             Germany        4,308,854
4               India        3,736,882
..                ...              ...
186  Marshall Islands              291
187             Palau              262
188          Kiribati              248
189             Nauru              151
190            Tuvalu               65

[191 rows x 2 columns]

In [78]:
def transform(df):
    ''' This function converts the GDP information from Currency
    format to float value, transforms the information of GDP from
    USD (Millions) to USD (Billions) rounding to 2 decimal places.
    The function returns the transformed dataframe.'''
    GDP_list = df["GDP_USD_millions"].tolist()
    GDP_list = [float("".join(x.split(','))) for x in GDP_list]
    GDP_list = [np.round(x/1000,2) for x in GDP_list]
    df["GDP_USD_millions"] = GDP_list
    df=df.rename(columns = {"GDP_USD_millions":"GDP_USD_billions"})
    return df

In [79]:
df

              Country  GDP_USD_billions
0       United States          26854.60
1               China          19373.59
2               Japan           4409.74
3             Germany           4308.85
4               India           3736.88
..                ...               ...
186  Marshall Islands              0.29
187             Palau              0.26
188          Kiribati              0.25
189             Nauru              0.15
190            Tuvalu              0.06

[191 rows x 2 columns]

In [80]:
def load_to_csv(df, csv_path):
    df.to_csv(csv_path)

In [81]:
load_to_csv(df, csv_path)

In [82]:
def load_to_db(df, sql_connection, table_name):
    df.to_sql(table_name, sql_connection, if_exists='replace', index=False)

In [48]:
sql_connection = sqlite3.connect('World_Economies.db')
load_to_db(df, sql_connection, table_name)

In [49]:
def run_query(query_statement, sql_connection):
    print(query_statement)
    query_output = pd.read_sql(query_statement, sql_connection)
    print(query_output)

In [50]:
query_statement = f"SELECT * from {table_name} WHERE GDP_USD_billions >= 150"
run_query(query_statement, sql_connection)
sql_connection.close()

SELECT * from Countries_by_GDP WHERE GDP_USD_billions >= 150
                 Country  GDP_USD_billions
0          United States          26854.60
1                  China          19373.59
2                  Japan           4409.74
3                Germany           4308.85
4                  India           3736.88
5         United Kingdom           3158.94
6                 France           2923.49
7                  Italy           2169.74
8                 Canada           2089.67
9                 Brazil           2081.24
10                Russia           2062.65
11           South Korea           1721.91
12             Australia           1707.55
13                Mexico           1663.16
14                 Spain           1492.43
15             Indonesia           1391.78
16           Netherlands           1080.88
17          Saudi Arabia           1061.90
18                Turkey           1029.30
19           Switzerland            869.60
20                Taiwan            790.73
21                Poland            748.89
22             Argentina            641.10
23               Belgium            624.25
24                Sweden            599.05
25               Ireland            594.10
26              Thailand            574.23
27                Norway            554.10
28                Israel            539.22
29             Singapore            515.55
30               Austria            515.20
31               Nigeria            506.60
32  United Arab Emirates            498.98
33               Vietnam            449.09
34              Malaysia            447.03
35           Philippines            440.90
36            Bangladesh            420.52
37               Denmark            405.63
38          South Africa            399.02
39             Hong Kong            382.85
40                 Egypt            378.11
41                  Iran            367.97
42                 Chile            358.56
43               Romania            348.90
44              Colombia            334.69
45        Czech Republic            330.48
46               Finland            301.67
47                  Peru            268.24
48                  Iraq            267.89
49              Portugal            267.72
50           New Zealand            251.97
51            Kazakhstan            245.70
52                Greece            239.30
53                 Qatar            219.57
54               Algeria            206.01
55               Hungary            188.50
56                Kuwait            164.71
57              Ethiopia            156.08

In [183]:
url = 'https://web.archive.org/web/20230902185655/https://en.everybodywiki.com/100_Most_Highly-Ranked_Films'
db_name = 'Movies.db'
table_name = 'Top_50'
csv_path = '/home/project/top_50_films.csv'
df = pd.DataFrame(columns=["Average Rank","Film","Year"])
count = 0

In [184]:
html_page = requests.get(url).text
data = BeautifulSoup(html_page, 'html.parser')

In [185]:
tables = data.find_all('tbody')
rows = tables[0].find_all('tr')

In [186]:
for row in rows:
    if count<50:
        col = row.find_all('td')
        if len(col)!=0:
            data_dict = {"Average Rank": col[0].contents[0],
                         "Film": col[1].contents[0],
                         "Year": col[2].contents[0]}
            df1 = pd.DataFrame(data_dict, index=[0])
            df = pd.concat([df,df1], ignore_index=True)
            count+=1
    else:
        break

In [187]:
print(df)

   Average Rank                                           Film  Year
0             1                                  The Godfather  1972
1             2                                   Citizen Kane  1941
2             3                                     Casablanca  1942
3             4                         The Godfather, Part II  1974
4             5                            Singin' in the Rain  1952
5             6                                         Psycho  1960
6             7                                    Rear Window  1954
7             8                                 Apocalypse Now  1979
8             9                          2001: A Space Odyssey  1968
9            10                                  Seven Samurai  1954
10           11                                        Vertigo  1958
11           12                                    Sunset Blvd  1950
12           13                                   Modern Times  1936
13           14                             Lawrence of Arabia  1962
14           15                             North by Northwest  1959
15           16                                      Star Wars  1977
16           17                                       Parasite  2019
17           18                               Schindler's List  1993
18           19  Lord of the Rings: The Fellowship of the Ring  2001
19           20                           Shawshank Redemption  1994
20           21                          It's a Wonderful Life  1946
21           22                                   Pulp Fiction  1994
22           23                              Avengers: Endgame  2019
23           24                                    City Lights  1931
24           25                One Flew Over the Cuckoo's Nest  1975
25           26                                     Goodfellas  1990
26           27                        Raiders of the Lost Ark  1981
27           28                                   12 Angry Men  1957
28           29                       The Silence of the Lambs  1991
29           30                                    Taxi Driver  1976
30           31                            Saving Private Ryan  1998
31           32                     E.T. the Extra Terrestrial  1982
32           33                                          Alien  1979
33           34              Spider-Man: Into the Spider-verse  2018
34           35                                   Blade Runner  1982
35           36                               Double Indemnity  1944
36           37                                The Dark Knight  2008
37           38                               The Wizard of Oz  1939
38           39  Star Wars: Episode V- The Empire Strikes Back  1980
39           40                                  The Searchers  1956
40           41                             Mad Max: Fury Road  2015
41           42                                      Inception  2010
42           43          Lord of the Rings: Return of the King  2003
43           44                                     The Matrix  1999
44           45                                     Fight Club  1999
45           46                             Back to the Future  1985
46           47                          It Happened One Night  1934
47           48                The Good, the Bad, and the Ugly  1966
48           49              Lord of the Rings: The Two Towers  2002
49           50                                  All About Eve  1950